---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireTypeSetIterator.#ctor
source: html/e8073a53-ef7e-5c22-c970-c461ab90f60d.htm
---
# Autodesk.Revit.DB.Electrical.WireTypeSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public WireTypeSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.